
// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// Выполнить с помощью числовых операций (целочисленное деление, остаток от деления).

// 14212 -> нет
// 12821 -> да
// 23432 -> да



// Console.Write("Введите положительное пятизначное число: ");
// int new = Convert.ToInt32 (Console.ReadLine());
// void Palind(int newPal)
// {
//     if (new<)
    
// }

// Palind (new);




// double Vektor (int axN, int ayN, int azN, int bxN, int byN, int bzN)
// {
//     double dlina = Math.Sqrt((bxN-axN)*(bxN-axN) + (byN-ayN)*(byN-ayN) + (bzN-azN)*(bzN-azN));
//     return dlina;
// }

// double vektor = Math.Round (Vektor (ax, ay, az, bx, by, bz), 2);

// Console.Write($"Расстояние между двумя точками A ({ax},{ay},{az}) и B ({bx},{by},{bz}) : {vektor}");